Revit 2024 API
AdvancedLossFactor Constructor
 Creates an advanced loss factor object with values set to no loss.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public AdvancedLossFactor()
Visual Basic
Public Sub New
Visual C++
public:
AdvancedLossFactor()
See Also
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace